const fs = require('fs');
const beautify = require("json-beautify");
let a = [ {
    "name": "台湾省",
    "id": 3703,
    "level": 1,
    "parentid": 1,
    "children": [
      {
        "name": "连江县",
        "id": "712800",
        "children": [
          {
            "name": "南竿乡",
            "id": "712805"
          },
          {
            "name": "北竿乡",
            "id": "712806"
          },
          {
            "name": "莒光乡",
            "id": "712807"
          },
          {
            "name": "东引乡",
            "id": "712808"
          }
        ]
      },
      {
        "name": "澎湖县",
        "id": "712700",
        "children": [
          {
            "name": "马公市",
            "id": "712707"
          },
          {
            "name": "西屿乡",
            "id": "712708"
          },
          {
            "name": "望安乡",
            "id": "712709"
          },
          {
            "name": "七美乡",
            "id": "712710"
          },
          {
            "name": "白沙乡",
            "id": "712711"
          },
          {
            "name": "湖西乡",
            "id": "712712"
          }
        ]
      },
      {
        "name": "花莲县",
        "id": "712600",
        "children": [
          {
            "name": "花莲市",
            "id": "712615"
          },
          {
            "name": "新城乡",
            "id": "712616"
          },
          {
            "name": "太鲁阁",
            "id": "712617"
          },
          {
            "name": "秀林乡",
            "id": "712618"
          },
          {
            "name": "吉安乡",
            "id": "712619"
          },
          {
            "name": "寿丰乡",
            "id": "712620"
          },
          {
            "name": "凤林镇",
            "id": "712621"
          },
          {
            "name": "光复乡",
            "id": "712622"
          },
          {
            "name": "丰滨乡",
            "id": "712623"
          },
          {
            "name": "瑞穗乡",
            "id": "712624"
          },
          {
            "name": "万荣乡",
            "id": "712625"
          },
          {
            "name": "玉里镇",
            "id": "712626"
          },
          {
            "name": "卓溪乡",
            "id": "712627"
          },
          {
            "name": "富里乡",
            "id": "712628"
          }
        ]
      },
      {
        "name": "台东县",
        "id": "712500",
        "children": [
          {
            "name": "台东市",
            "id": "712517"
          },
          {
            "name": "绿岛乡",
            "id": "712518"
          },
          {
            "name": "兰屿乡",
            "id": "712519"
          },
          {
            "name": "延平乡",
            "id": "712520"
          },
          {
            "name": "卑南乡",
            "id": "712521"
          },
          {
            "name": "鹿野乡",
            "id": "712522"
          },
          {
            "name": "关山镇",
            "id": "712523"
          },
          {
            "name": "海端乡",
            "id": "712524"
          },
          {
            "name": "池上乡",
            "id": "712525"
          },
          {
            "name": "东河乡",
            "id": "712526"
          },
          {
            "name": "成功镇",
            "id": "712527"
          },
          {
            "name": "长滨乡",
            "id": "712528"
          },
          {
            "name": "金峰乡",
            "id": "712529"
          },
          {
            "name": "大武乡",
            "id": "712530"
          },
          {
            "name": "达仁乡",
            "id": "712531"
          },
          {
            "name": "太麻里乡",
            "id": "712532"
          }
        ]
      },
      {
        "name": "屏东县",
        "id": "712400",
        "children": [
          {
            "name": "屏东市",
            "id": "712434"
          },
          {
            "name": "三地门乡",
            "id": "712435"
          },
          {
            "name": "雾台乡",
            "id": "712436"
          },
          {
            "name": "玛家乡",
            "id": "712437"
          },
          {
            "name": "九如乡",
            "id": "712438"
          },
          {
            "name": "里港乡",
            "id": "712439"
          },
          {
            "name": "高树乡",
            "id": "712440"
          },
          {
            "name": "盐埔乡",
            "id": "712441"
          },
          {
            "name": "长治乡",
            "id": "712442"
          },
          {
            "name": "麟洛乡",
            "id": "712443"
          },
          {
            "name": "竹田乡",
            "id": "712444"
          },
          {
            "name": "内埔乡",
            "id": "712445"
          },
          {
            "name": "万丹乡",
            "id": "712446"
          },
          {
            "name": "潮州镇",
            "id": "712447"
          },
          {
            "name": "泰武乡",
            "id": "712448"
          },
          {
            "name": "来义乡",
            "id": "712449"
          },
          {
            "name": "万峦乡",
            "id": "712450"
          },
          {
            "name": "崁顶乡",
            "id": "712451"
          },
          {
            "name": "新埤乡",
            "id": "712452"
          },
          {
            "name": "南州乡",
            "id": "712453"
          },
          {
            "name": "林边乡",
            "id": "712454"
          },
          {
            "name": "东港镇",
            "id": "712455"
          },
          {
            "name": "琉球乡",
            "id": "712456"
          },
          {
            "name": "佳冬乡",
            "id": "712457"
          },
          {
            "name": "新园乡",
            "id": "712458"
          },
          {
            "name": "枋寮乡",
            "id": "712459"
          },
          {
            "name": "枋山乡",
            "id": "712460"
          },
          {
            "name": "春日乡",
            "id": "712461"
          },
          {
            "name": "狮子乡",
            "id": "712462"
          },
          {
            "name": "车城乡",
            "id": "712463"
          },
          {
            "name": "牡丹乡",
            "id": "712464"
          },
          {
            "name": "恒春镇",
            "id": "712465"
          },
          {
            "name": "满州乡",
            "id": "712466"
          }
        ]
      },
      {
        "name": "云林县",
        "id": "712100",
        "children": [
          {
            "name": "斗南镇",
            "id": "712121"
          },
          {
            "name": "大埤乡",
            "id": "712122"
          },
          {
            "name": "虎尾镇",
            "id": "712123"
          },
          {
            "name": "土库镇",
            "id": "712124"
          },
          {
            "name": "褒忠乡",
            "id": "712125"
          },
          {
            "name": "东势乡",
            "id": "712126"
          },
          {
            "name": "台西乡",
            "id": "712127"
          },
          {
            "name": "仑背乡",
            "id": "712128"
          },
          {
            "name": "麦寮乡",
            "id": "712129"
          },
          {
            "name": "斗六市",
            "id": "712130"
          },
          {
            "name": "林内乡",
            "id": "712131"
          },
          {
            "name": "古坑乡",
            "id": "712132"
          },
          {
            "name": "莿桐乡",
            "id": "712133"
          },
          {
            "name": "西螺镇",
            "id": "712134"
          },
          {
            "name": "二仑乡",
            "id": "712135"
          },
          {
            "name": "北港镇",
            "id": "712136"
          },
          {
            "name": "水林乡",
            "id": "712137"
          },
          {
            "name": "口湖乡",
            "id": "712138"
          },
          {
            "name": "四湖乡",
            "id": "712139"
          }
        ]
      },
      {
        "name": "嘉义县",
        "id": "711900",
        "children": [
          {
            "name": "番路乡",
            "id": "711919"
          },
          {
            "name": "梅山乡",
            "id": "711920"
          },
          {
            "name": "竹崎乡",
            "id": "711921"
          },
          {
            "name": "阿里山乡",
            "id": "711922"
          },
          {
            "name": "中埔乡",
            "id": "711923"
          },
          {
            "name": "大埔乡",
            "id": "711924"
          },
          {
            "name": "水上乡",
            "id": "711925"
          },
          {
            "name": "鹿草乡",
            "id": "711926"
          },
          {
            "name": "太保市",
            "id": "711927"
          },
          {
            "name": "朴子市",
            "id": "711928"
          },
          {
            "name": "东石乡",
            "id": "711929"
          },
          {
            "name": "六脚乡",
            "id": "711930"
          },
          {
            "name": "新港乡",
            "id": "711931"
          },
          {
            "name": "民雄乡",
            "id": "711932"
          },
          {
            "name": "大林镇",
            "id": "711933"
          },
          {
            "name": "溪口乡",
            "id": "711934"
          },
          {
            "name": "义竹乡",
            "id": "711935"
          },
          {
            "name": "布袋镇",
            "id": "711936"
          }
        ]
      },
      {
        "name": "彰化县",
        "id": "711700",
        "children": [
          {
            "name": "彰化市",
            "id": "711727"
          },
          {
            "name": "芬园乡",
            "id": "711728"
          },
          {
            "name": "花坛乡",
            "id": "711729"
          },
          {
            "name": "秀水乡",
            "id": "711730"
          },
          {
            "name": "鹿港镇",
            "id": "711731"
          },
          {
            "name": "福兴乡",
            "id": "711732"
          },
          {
            "name": "线西乡",
            "id": "711733"
          },
          {
            "name": "和美镇",
            "id": "711734"
          },
          {
            "name": "伸港乡",
            "id": "711735"
          },
          {
            "name": "员林镇",
            "id": "711736"
          },
          {
            "name": "社头乡",
            "id": "711737"
          },
          {
            "name": "永靖乡",
            "id": "711738"
          },
          {
            "name": "埔心乡",
            "id": "711739"
          },
          {
            "name": "溪湖镇",
            "id": "711740"
          },
          {
            "name": "大村乡",
            "id": "711741"
          },
          {
            "name": "埔盐乡",
            "id": "711742"
          },
          {
            "name": "田中镇",
            "id": "711743"
          },
          {
            "name": "北斗镇",
            "id": "711744"
          },
          {
            "name": "田尾乡",
            "id": "711745"
          },
          {
            "name": "埤头乡",
            "id": "711746"
          },
          {
            "name": "溪州乡",
            "id": "711747"
          },
          {
            "name": "竹塘乡",
            "id": "711748"
          },
          {
            "name": "二林镇",
            "id": "711749"
          },
          {
            "name": "大城乡",
            "id": "711750"
          },
          {
            "name": "芳苑乡",
            "id": "711751"
          },
          {
            "name": "二水乡",
            "id": "711752"
          }
        ]
      },
      {
        "name": "苗栗县",
        "id": "711500",
        "children": [
          {
            "name": "竹南镇",
            "id": "711519"
          },
          {
            "name": "头份镇",
            "id": "711520"
          },
          {
            "name": "三湾乡",
            "id": "711521"
          },
          {
            "name": "南庄乡",
            "id": "711522"
          },
          {
            "name": "狮潭乡",
            "id": "711523"
          },
          {
            "name": "后龙镇",
            "id": "711524"
          },
          {
            "name": "通霄镇",
            "id": "711525"
          },
          {
            "name": "苑里镇",
            "id": "711526"
          },
          {
            "name": "苗栗市",
            "id": "711527"
          },
          {
            "name": "造桥乡",
            "id": "711528"
          },
          {
            "name": "头屋乡",
            "id": "711529"
          },
          {
            "name": "公馆乡",
            "id": "711530"
          },
          {
            "name": "大湖乡",
            "id": "711531"
          },
          {
            "name": "泰安乡",
            "id": "711532"
          },
          {
            "name": "铜锣乡",
            "id": "711533"
          },
          {
            "name": "三义乡",
            "id": "711534"
          },
          {
            "name": "西湖乡",
            "id": "711535"
          },
          {
            "name": "卓兰镇",
            "id": "711536"
          }
        ]
      },
      {
        "name": "桃园县",
        "id": "711400",
        "children": [
          {
            "name": "中坜市",
            "id": "711414"
          },
          {
            "name": "平镇市",
            "id": "711415"
          },
          {
            "name": "龙潭乡",
            "id": "711416"
          },
          {
            "name": "杨梅市",
            "id": "711417"
          },
          {
            "name": "新屋乡",
            "id": "711418"
          },
          {
            "name": "观音乡",
            "id": "711419"
          },
          {
            "name": "桃园市",
            "id": "711420"
          },
          {
            "name": "龟山乡",
            "id": "711421"
          },
          {
            "name": "八德市",
            "id": "711422"
          },
          {
            "name": "大溪镇",
            "id": "711423"
          },
          {
            "name": "复兴乡",
            "id": "711424"
          },
          {
            "name": "大园乡",
            "id": "711425"
          },
          {
            "name": "芦竹乡",
            "id": "711426"
          }
        ]
      },
      {
        "name": "新竹县",
        "id": "711300",
        "children": [
          {
            "name": "竹北市",
            "id": "711314"
          },
          {
            "name": "湖口乡",
            "id": "711315"
          },
          {
            "name": "新丰乡",
            "id": "711316"
          },
          {
            "name": "新埔镇",
            "id": "711317"
          },
          {
            "name": "关西镇",
            "id": "711318"
          },
          {
            "name": "芎林乡",
            "id": "711319"
          },
          {
            "name": "宝山乡",
            "id": "711320"
          },
          {
            "name": "竹东镇",
            "id": "711321"
          },
          {
            "name": "五峰乡",
            "id": "711322"
          },
          {
            "name": "横山乡",
            "id": "711323"
          },
          {
            "name": "尖石乡",
            "id": "711324"
          },
          {
            "name": "北埔乡",
            "id": "711325"
          },
          {
            "name": "峨眉乡",
            "id": "711326"
          }
        ]
      },
      {
        "name": "宜兰县",
        "id": "711200",
        "children": [
          {
            "name": "宜兰市",
            "id": "711214"
          },
          {
            "name": "头城镇",
            "id": "711215"
          },
          {
            "name": "礁溪乡",
            "id": "711216"
          },
          {
            "name": "壮围乡",
            "id": "711217"
          },
          {
            "name": "员山乡",
            "id": "711218"
          },
          {
            "name": "罗东镇",
            "id": "711219"
          },
          {
            "name": "三星乡",
            "id": "711220"
          },
          {
            "name": "大同乡",
            "id": "711221"
          },
          {
            "name": "五结乡",
            "id": "711222"
          },
          {
            "name": "冬山乡",
            "id": "711223"
          },
          {
            "name": "苏澳镇",
            "id": "711224"
          },
          {
            "name": "南澳乡",
            "id": "711225"
          },
          {
            "name": "钓鱼台",
            "id": "711226"
          }
        ]
      },
      {
        "name": "新北市",
        "id": "711100",
        "children": [
          {
            "name": "万里区",
            "id": "711130"
          },
          {
            "name": "金山区",
            "id": "711131"
          },
          {
            "name": "板桥区",
            "id": "711132"
          },
          {
            "name": "汐止区",
            "id": "711133"
          },
          {
            "name": "深坑区",
            "id": "711134"
          },
          {
            "name": "石碇区",
            "id": "711135"
          },
          {
            "name": "瑞芳区",
            "id": "711136"
          },
          {
            "name": "平溪区",
            "id": "711137"
          },
          {
            "name": "双溪区",
            "id": "711138"
          },
          {
            "name": "贡寮区",
            "id": "711139"
          },
          {
            "name": "新店区",
            "id": "711140"
          },
          {
            "name": "坪林区",
            "id": "711141"
          },
          {
            "name": "乌来区",
            "id": "711142"
          },
          {
            "name": "永和区",
            "id": "711143"
          },
          {
            "name": "中和区",
            "id": "711144"
          },
          {
            "name": "土城区",
            "id": "711145"
          },
          {
            "name": "三峡区",
            "id": "711146"
          },
          {
            "name": "树林区",
            "id": "711147"
          },
          {
            "name": "莺歌区",
            "id": "711148"
          },
          {
            "name": "三重区",
            "id": "711149"
          },
          {
            "name": "新庄区",
            "id": "711150"
          },
          {
            "name": "泰山区",
            "id": "711151"
          },
          {
            "name": "林口区",
            "id": "711152"
          },
          {
            "name": "芦洲区",
            "id": "711153"
          },
          {
            "name": "五股区",
            "id": "711154"
          },
          {
            "name": "八里区",
            "id": "711155"
          },
          {
            "name": "淡水区",
            "id": "711156"
          },
          {
            "name": "三芝区",
            "id": "711157"
          },
          {
            "name": "石门区",
            "id": "711158"
          }
        ]
      },
      {
        "name": "嘉义市",
        "id": "710900",
        "children": [
          {
            "name": "东区",
            "id": "710901"
          },
          {
            "name": "西区",
            "id": "710902"
          },
          {
            "name": "其它区",
            "id": "710903"
          }
        ]
      },
      {
        "name": "新竹市",
        "id": "710800",
        "children": [
          {
            "name": "东区",
            "id": "710801"
          },
          {
            "name": "北区",
            "id": "710802"
          },
          {
            "name": "香山区",
            "id": "710803"
          },
          {
            "name": "其它区",
            "id": "710804"
          }
        ]
      },
      {
        "name": "基隆市",
        "id": "710700",
        "children": [
          {
            "name": "仁爱区",
            "id": "710701"
          },
          {
            "name": "信义区",
            "id": "710702"
          },
          {
            "name": "中正区",
            "id": "710703"
          },
          {
            "name": "中山区",
            "id": "710704"
          },
          {
            "name": "安乐区",
            "id": "710705"
          },
          {
            "name": "暖暖区",
            "id": "710706"
          },
          {
            "name": "七堵区",
            "id": "710707"
          },
          {
            "name": "其它区",
            "id": "710708"
          }
        ]
      },
      {
        "name": "南投县",
        "id": "710600",
        "children": [
          {
            "name": "南投市",
            "id": "710614"
          },
          {
            "name": "中寮乡",
            "id": "710615"
          },
          {
            "name": "草屯镇",
            "id": "710616"
          },
          {
            "name": "国姓乡",
            "id": "710617"
          },
          {
            "name": "埔里镇",
            "id": "710618"
          },
          {
            "name": "仁爱乡",
            "id": "710619"
          },
          {
            "name": "名间乡",
            "id": "710620"
          },
          {
            "name": "集集镇",
            "id": "710621"
          },
          {
            "name": "水里乡",
            "id": "710622"
          },
          {
            "name": "鱼池乡",
            "id": "710623"
          },
          {
            "name": "信义乡",
            "id": "710624"
          },
          {
            "name": "竹山镇",
            "id": "710625"
          },
          {
            "name": "鹿谷乡",
            "id": "710626"
          }
        ]
      },
      {
        "name": "金门县",
        "id": "710500",
        "children": [
          {
            "name": "金沙镇",
            "id": "710507"
          },
          {
            "name": "金湖镇",
            "id": "710508"
          },
          {
            "name": "金宁乡",
            "id": "710509"
          },
          {
            "name": "金城镇",
            "id": "710510"
          },
          {
            "name": "烈屿乡",
            "id": "710511"
          },
          {
            "name": "乌坵乡",
            "id": "710512"
          }
        ]
      },
      {
        "name": "台中市",
        "id": "710400",
        "children": [
          {
            "name": "中区",
            "id": "710401"
          },
          {
            "name": "东区",
            "id": "710402"
          },
          {
            "name": "南区",
            "id": "710403"
          },
          {
            "name": "西区",
            "id": "710404"
          },
          {
            "name": "北区",
            "id": "710405"
          },
          {
            "name": "北屯区",
            "id": "710406"
          },
          {
            "name": "西屯区",
            "id": "710407"
          },
          {
            "name": "南屯区",
            "id": "710408"
          },
          {
            "name": "其它区",
            "id": "710409"
          },
          {
            "name": "太平区",
            "id": "710431"
          },
          {
            "name": "大里区",
            "id": "710432"
          },
          {
            "name": "雾峰区",
            "id": "710433"
          },
          {
            "name": "乌日区",
            "id": "710434"
          },
          {
            "name": "丰原区",
            "id": "710435"
          },
          {
            "name": "后里区",
            "id": "710436"
          },
          {
            "name": "石冈区",
            "id": "710437"
          },
          {
            "name": "东势区",
            "id": "710438"
          },
          {
            "name": "和平区",
            "id": "710439"
          },
          {
            "name": "新社区",
            "id": "710440"
          },
          {
            "name": "潭子区",
            "id": "710441"
          },
          {
            "name": "大雅区",
            "id": "710442"
          },
          {
            "name": "神冈区",
            "id": "710443"
          },
          {
            "name": "大肚区",
            "id": "710444"
          },
          {
            "name": "沙鹿区",
            "id": "710445"
          },
          {
            "name": "龙井区",
            "id": "710446"
          },
          {
            "name": "梧栖区",
            "id": "710447"
          },
          {
            "name": "清水区",
            "id": "710448"
          },
          {
            "name": "大甲区",
            "id": "710449"
          },
          {
            "name": "外埔区",
            "id": "710450"
          },
          {
            "name": "大安区",
            "id": "710451"
          }
        ]
      },
      {
        "name": "台南市",
        "id": "710300",
        "children": [
          {
            "name": "中西区",
            "id": "710301"
          },
          {
            "name": "东区",
            "id": "710302"
          },
          {
            "name": "南区",
            "id": "710303"
          },
          {
            "name": "北区",
            "id": "710304"
          },
          {
            "name": "安平区",
            "id": "710305"
          },
          {
            "name": "安南区",
            "id": "710306"
          },
          {
            "name": "其它区",
            "id": "710307"
          },
          {
            "name": "永康区",
            "id": "710339"
          },
          {
            "name": "归仁区",
            "id": "710340"
          },
          {
            "name": "新化区",
            "id": "710341"
          },
          {
            "name": "左镇区",
            "id": "710342"
          },
          {
            "name": "玉井区",
            "id": "710343"
          },
          {
            "name": "楠西区",
            "id": "710344"
          },
          {
            "name": "南化区",
            "id": "710345"
          },
          {
            "name": "仁德区",
            "id": "710346"
          },
          {
            "name": "关庙区",
            "id": "710347"
          },
          {
            "name": "龙崎区",
            "id": "710348"
          },
          {
            "name": "官田区",
            "id": "710349"
          },
          {
            "name": "麻豆区",
            "id": "710350"
          },
          {
            "name": "佳里区",
            "id": "710351"
          },
          {
            "name": "西港区",
            "id": "710352"
          },
          {
            "name": "七股区",
            "id": "710353"
          },
          {
            "name": "将军区",
            "id": "710354"
          },
          {
            "name": "学甲区",
            "id": "710355"
          },
          {
            "name": "北门区",
            "id": "710356"
          },
          {
            "name": "新营区",
            "id": "710357"
          },
          {
            "name": "后壁区",
            "id": "710358"
          },
          {
            "name": "白河区",
            "id": "710359"
          },
          {
            "name": "东山区",
            "id": "710360"
          },
          {
            "name": "六甲区",
            "id": "710361"
          },
          {
            "name": "下营区",
            "id": "710362"
          },
          {
            "name": "柳营区",
            "id": "710363"
          },
          {
            "name": "盐水区",
            "id": "710364"
          },
          {
            "name": "善化区",
            "id": "710365"
          },
          {
            "name": "大内区",
            "id": "710366"
          },
          {
            "name": "山上区",
            "id": "710367"
          },
          {
            "name": "新市区",
            "id": "710368"
          },
          {
            "name": "安定区",
            "id": "710369"
          }
        ]
      },
      {
        "name": "高雄市",
        "id": "710200",
        "children": [
          {
            "name": "新兴区",
            "id": "710201"
          },
          {
            "name": "前金区",
            "id": "710202"
          },
          {
            "name": "芩雅区",
            "id": "710203"
          },
          {
            "name": "盐埕区",
            "id": "710204"
          },
          {
            "name": "鼓山区",
            "id": "710205"
          },
          {
            "name": "旗津区",
            "id": "710206"
          },
          {
            "name": "前镇区",
            "id": "710207"
          },
          {
            "name": "三民区",
            "id": "710208"
          },
          {
            "name": "左营区",
            "id": "710209"
          },
          {
            "name": "楠梓区",
            "id": "710210"
          },
          {
            "name": "小港区",
            "id": "710211"
          },
          {
            "name": "其它区",
            "id": "710212"
          },
          {
            "name": "苓雅区",
            "id": "710241"
          },
          {
            "name": "仁武区",
            "id": "710242"
          },
          {
            "name": "大社区",
            "id": "710243"
          },
          {
            "name": "冈山区",
            "id": "710244"
          },
          {
            "name": "路竹区",
            "id": "710245"
          },
          {
            "name": "阿莲区",
            "id": "710246"
          },
          {
            "name": "田寮区",
            "id": "710247"
          },
          {
            "name": "燕巢区",
            "id": "710248"
          },
          {
            "name": "桥头区",
            "id": "710249"
          },
          {
            "name": "梓官区",
            "id": "710250"
          },
          {
            "name": "弥陀区",
            "id": "710251"
          },
          {
            "name": "永安区",
            "id": "710252"
          },
          {
            "name": "湖内区",
            "id": "710253"
          },
          {
            "name": "凤山区",
            "id": "710254"
          },
          {
            "name": "大寮区",
            "id": "710255"
          },
          {
            "name": "林园区",
            "id": "710256"
          },
          {
            "name": "鸟松区",
            "id": "710257"
          },
          {
            "name": "大树区",
            "id": "710258"
          },
          {
            "name": "旗山区",
            "id": "710259"
          },
          {
            "name": "美浓区",
            "id": "710260"
          },
          {
            "name": "六龟区",
            "id": "710261"
          },
          {
            "name": "内门区",
            "id": "710262"
          },
          {
            "name": "杉林区",
            "id": "710263"
          },
          {
            "name": "甲仙区",
            "id": "710264"
          },
          {
            "name": "桃源区",
            "id": "710265"
          },
          {
            "name": "那玛夏区",
            "id": "710266"
          },
          {
            "name": "茂林区",
            "id": "710267"
          },
          {
            "name": "茄萣区",
            "id": "710268"
          }
        ]
      },
      {
        "name": "台北市",
        "id": "710100",
        "children": [
          {
            "name": "中正区",
            "id": "710101"
          },
          {
            "name": "大同区",
            "id": "710102"
          },
          {
            "name": "中山区",
            "id": "710103"
          },
          {
            "name": "松山区",
            "id": "710104"
          },
          {
            "name": "大安区",
            "id": "710105"
          },
          {
            "name": "万华区",
            "id": "710106"
          },
          {
            "name": "信义区",
            "id": "710107"
          },
          {
            "name": "士林区",
            "id": "710108"
          },
          {
            "name": "北投区",
            "id": "710109"
          },
          {
            "name": "内湖区",
            "id": "710110"
          },
          {
            "name": "南港区",
            "id": "710111"
          },
          {
            "name": "文山区",
            "id": "710112"
          },
          {
            "name": "其它区",
            "id": "710113"
          }
        ]
      }
    ]
  },
  {
    "name": "澳门特别行政区",
    "id": 3704,
    "level": 1,
    "parentid": 1,
    "children": [
      {
        "name": "离岛",
        "id": "820200",
        "children": [
          {
            "name": "离岛",
            "id": "820200"
          }
        ]
      },
      {
        "name": "澳门半岛",
        "id": "820100",
        "children": [
          {
            "name": "澳门半岛",
            "id": "820100"
          }
        ]
      }
    ]
  },
  {
    "name": "香港特别行政区",
    "id": 3705,
    "level": 1,
    "parentid": 1,
    "children": [
      {
        "name": "新界",
        "id": "810300",
        "children": [
          {
            "name": "北区",
            "id": "810301"
          },
          {
            "name": "大埔区",
            "id": "810302"
          },
          {
            "name": "沙田区",
            "id": "810303"
          },
          {
            "name": "西贡区",
            "id": "810304"
          },
          {
            "name": "元朗区",
            "id": "810305"
          },
          {
            "name": "屯门区",
            "id": "810306"
          },
          {
            "name": "荃湾区",
            "id": "810307"
          },
          {
            "name": "葵青区",
            "id": "810308"
          },
          {
            "name": "离岛区",
            "id": "810309"
          }
        ]
      },
      {
        "name": "九龙",
        "id": "810200",
        "children": [
          {
            "name": "九龙城区",
            "id": "810201"
          },
          {
            "name": "油尖旺区",
            "id": "810202"
          },
          {
            "name": "深水埗区",
            "id": "810203"
          },
          {
            "name": "黄大仙区",
            "id": "810204"
          },
          {
            "name": "观塘区",
            "id": "810205"
          }
        ]
      },
      {
        "name": "香港岛",
        "id": "810100",
        "children": [
          {
            "name": "中西区",
            "id": "810101"
          },
          {
            "name": "湾仔",
            "id": "810102"
          },
          {
            "name": "东区",
            "id": "810103"
          },
          {
            "name": "南区",
            "id": "810104"
          }
        ]
      }
    ]
  }]

  function change(arr){
    for(let i = 0 ; i < arr.length; i++) {
        let item = arr[i];
        item.id = parseInt(item.id);
        if(item.children){
            change(item.children);
        }
    }
  }

  const recutive = (args) => {
    return (args || []).map((item) => {
      return {
        ...item,
        id: typeof(item.id) !== 'number' ? parseInt(item.id) : item.id,
        children: recutive(item.children || [])
      }
    })
  }
 
  fs.writeFileSync('./shengshiqu.json', beautify(recutive(a), null, 2, 80));
  // change(a);